<?php
/**
 * 开发环境应用配置文件
 */
//
define('YES', 1);
define('NO', 0);
//--------------------------------------ajax或者api请求返回json状态START-----------------------------------------
define('RESPONSE_SUCCESS', 1);
define('RESPONSE_FAIL', 0);
//--------------------------------------ajax或者api请求返回json状态END-------------------------------------------


//--------------------------------------正则表达式验证规则START--------------------------------------------------
//邮箱验证规则
define('EMAIL_VALIDATION', "^[a-zA-Z0-9_+.-]+@([a-zA-Z0-9-]+\.)+[a-z0-9]{2,4}$");
//字母验证规则
define('ALPH_VALIDATION', "[A-Za-z]");
//数字验证规则
define('NUM_VALIDATION', "[0-9]");
//符号验证规则
define('SIGN_VALIDATION', "[~!@#$%^&*()\-_=+;:'\",<.>/?\\]");
//密码验证规则
define('PW_VALIDATION', "^[0-9a-zA-Z\~\!\@\#\$%\^&\*\(\)\-\_\=\+\;\:\'\"\,\<\.\>\/\?\\]{6,30}$");
//---------------------------------------正则表达式验证规则END---------------------------------------------------
return array(
    'APP_VERSION' => "1.0.0"
);